#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" тогда
		ВставитьПолеКонтактноеЛицоПередСуммойДок(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" тогда
		ВставитьПолеКонтактноеЛицоПередСуммойДок(Форма);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",  Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.м_КонтактноеЛицо";
	
	ИмяФормы = Форма.ИмяФормы;
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" тогда
		Группа = Форма.Элементы.Добавить("Скидка",  Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка",  Тип("ПолеФормы"), Форма.Элементы.Скидка);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.м_СогласованнаяСкидка"; 
		ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
		
		КомандаПересчитать = Форма.Элементы.Добавить("ПересчитатьТаблицы",Тип("КнопкаФормы"), Форма.Элементы.Скидка);
		КомандаПересчитать.ИмяКоманды = "ПересчитатьТаблицы";
		КомандаПересчитать.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоПередСуммойДок(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",  Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.м_КонтактноеЛицо";
	
КонецПроцедуры
#КонецОбласти

